Repository: SoloScripted/sudokode
Catalog: lib/l10n/app_*.arb
Languages: es

source: Congratulations!
es: ¡Felicidades!

# copyright
source: Â© 2025 SoloScripted
es: © 2025 SoloScripted

# homeScreenSubtitle
source: The Sudoku experience where mind, numbers, and AI meet.
es: La experiencia de Sudoku donde la mente, los números y la IA se encuentran.

source: New Game
es: Nuevo Juego

# newGameDialogContent
source: Are you sure you want to start a new game? Your current progress will be lost.
es: ¿Estás seguro de que quieres empezar un juego nuevo? Tu progreso actual se perderá.

# newGameDialogTitle
source: Start New Game?
es: ¿Empezar Nuevo Juego?

source: Play Again
es: Jugar de Nuevo

# puzzleSolved
source: You've solved the puzzle.
es: Has resuelto el puzle.

source: Reset
es: Reiniciar

# resetDialogContent
source: Are you sure you want to clear the board and start over?
es: ¿Estás seguro de que quieres limpiar el tablero y empezar de nuevo?

# resetDialogTitle
source: Reset Board?
es: ¿Reiniciar Tablero?

# resetDialogYes
source: Yes
es: Sí
